### Creating a dictionary with keys - First Name , Last Name , Phone Number, Company Name

In [85]:
employee_dict={"First Name": ['Rahul','Maneesh','Arjun','Eben','Ajay','Arjun','Azad','Manu','Manu','Akhil',
                              'Gangadathan','Sreejith','Sujith'],
              "Last Name":['Baby','M M',"Krishnankutty",'Luke Joy','Krishnan','Mohanan','Asok','Prasad','Mohan','Joy','PS',
                           'Mohanan','R Nair'],
              "Phone_NO":['8129361195','9388980023','9678876789','8943434512','9656064333',
                         '4566361191','9358980003','9678876700','8943434543','9656064555','8129361195','9388980023',
                          '9678876789'],
              "company":['Tranzmeo','Google','Apple','Microsoft','Twitter','Facebook','Amazon','Hcl','Techxer','American Express',
                        'Knowldege Foundry','Akaike Technologie','Internshala']}

In [86]:
employee_dict

{'First Name': ['Rahul',
  'Maneesh',
  'Arjun',
  'Eben',
  'Ajay',
  'Arjun',
  'Azad',
  'Manu',
  'Manu',
  'Akhil',
  'Gangadathan',
  'Sreejith',
  'Sujith'],
 'Last Name': ['Baby',
  'M M',
  'Krishnankutty',
  'Luke Joy',
  'Krishnan',
  'Mohanan',
  'Asok',
  'Prasad',
  'Mohan',
  'Joy',
  'PS',
  'Mohanan',
  'R Nair'],
 'Phone_NO': ['8129361195',
  '9388980023',
  '9678876789',
  '8943434512',
  '9656064333',
  '4566361191',
  '9358980003',
  '9678876700',
  '8943434543',
  '9656064555',
  '8129361195',
  '9388980023',
  '9678876789'],
 'company': ['Tranzmeo',
  'Google',
  'Apple',
  'Microsoft',
  'Twitter',
  'Facebook',
  'Amazon',
  'Hcl',
  'Techxer',
  'American Express',
  'Knowldege Foundry',
  'Akaike Technologie',
  'Internshala']}

In [87]:
import pandas as pd

## Convert the dictionary into dataframe and save it as a csv file

In [113]:
employee_df=pd.DataFrame(employee_dict).to_csv(r'C:\Users\MANEESH\employee_df.csv',index=False)#converting the employee dictionary to DataFrame

In [114]:
employee_df=pd.read_csv("employee_df.csv")# Reading the csv file

In [115]:
employee_df

     First Name      Last Name    Phone_NO             company
0         Rahul           Baby  8129361195            Tranzmeo
1       Maneesh            M M  9388980023              Google
2         Arjun  Krishnankutty  9678876789               Apple
3          Eben       Luke Joy  8943434512           Microsoft
4          Ajay       Krishnan  9656064333             Twitter
5         Arjun        Mohanan  4566361191            Facebook
6          Azad           Asok  9358980003              Amazon
7          Manu         Prasad  9678876700                 Hcl
8          Manu          Mohan  8943434543             Techxer
9         Akhil            Joy  9656064555    American Express
10  Gangadathan             PS  8129361195   Knowldege Foundry
11     Sreejith        Mohanan  9388980023  Akaike Technologie
12       Sujith         R Nair  9678876789         Internshala

In [138]:
employee_df['company'][1][0:2].upper()#taking firsh two characters form the company fileld and convert the string into uppercase

'GO'

In [140]:
employee_df.dtypes

First Name    object
Last Name     object
Phone_NO       int64
company       object
dtype: object

In [150]:
employee_df['Phone_NO']=employee_df['Phone_NO'].astype(str)

In [151]:
employee_df.dtypes

First Name    object
Last Name     object
Phone_NO      object
company       object
dtype: object

In [152]:
employee_df['Phone_NO'].dtypes

dtype('O')

In [153]:
employee_df['Phone_NO'][0][8:10] #Taking last two characters from Phone_NO

'95'

In [154]:
c_,ph_

(['TR', 'MM', 'TB', 'TK', 'TT'], ['95', '23', '89', '12', '33'])

In [155]:
#Here creating a list employee_id for getting the empoloyee id like expected output format : TR-00198
employee_id=[]
for i in range(0,len(employee_df)):
    employeeid = employee_df['company'][i][0:2].upper()+"-"+f"{i:03}"+employee_df['Phone_NO'][i][8:10]
    employee_id.append(employeeid)

In [156]:
employee_id

['TR-00095',
 'GO-00123',
 'AP-00289',
 'MI-00312',
 'TW-00433',
 'FA-00591',
 'AM-00603',
 'HC-00700',
 'TE-00843',
 'AM-00955',
 'KN-01095',
 'AK-01123',
 'IN-01289']

In [162]:
employee_ids=pd.DataFrame(employee_id,columns=['employee ids']).to_csv(r'C:\Users\MANEESH\employee_ids.csv',index=False)

In [164]:
employee_ids=pd.read_csv('employee_ids.csv')

In [165]:
#concatenate the two csv file ,final csv

final_df=pd.concat([employee_ids,employee_df],axis=1)

In [166]:
final_df

   employee ids   First Name      Last Name    Phone_NO             company
0      TR-00095        Rahul           Baby  8129361195            Tranzmeo
1      GO-00123      Maneesh            M M  9388980023              Google
2      AP-00289        Arjun  Krishnankutty  9678876789               Apple
3      MI-00312         Eben       Luke Joy  8943434512           Microsoft
4      TW-00433         Ajay       Krishnan  9656064333             Twitter
5      FA-00591        Arjun        Mohanan  4566361191            Facebook
6      AM-00603         Azad           Asok  9358980003              Amazon
7      HC-00700         Manu         Prasad  9678876700                 Hcl
8      TE-00843         Manu          Mohan  8943434543             Techxer
9      AM-00955        Akhil            Joy  9656064555    American Express
10     KN-01095  Gangadathan             PS  8129361195   Knowldege Foundry
11     AK-01123     Sreejith        Mohanan  9388980023  Akaike Technologie
12     IN-01289       Sujith         R Nair  9678876789         Internshala

In [167]:
#final_df to csv 

final_df.to_csv(r'C:\Users\MANEESH\final_data.csv',index=False)

In [169]:
pd.read_csv('final_data.csv')

   employee ids   First Name      Last Name    Phone_NO             company
0      TR-00095        Rahul           Baby  8129361195            Tranzmeo
1      GO-00123      Maneesh            M M  9388980023              Google
2      AP-00289        Arjun  Krishnankutty  9678876789               Apple
3      MI-00312         Eben       Luke Joy  8943434512           Microsoft
4      TW-00433         Ajay       Krishnan  9656064333             Twitter
5      FA-00591        Arjun        Mohanan  4566361191            Facebook
6      AM-00603         Azad           Asok  9358980003              Amazon
7      HC-00700         Manu         Prasad  9678876700                 Hcl
8      TE-00843         Manu          Mohan  8943434543             Techxer
9      AM-00955        Akhil            Joy  9656064555    American Express
10     KN-01095  Gangadathan             PS  8129361195   Knowldege Foundry
11     AK-01123     Sreejith        Mohanan  9388980023  Akaike Technologie
12     IN-01289       Sujith         R Nair  9678876789         Internshala